[Killed] StringLiteral
src/App.js:5:66
 import './App.css';
 
 function App() {
-    const [estado, setEstado] = useState([['', '', ''], ['', '', ''], ['', '', '']]);
+    const [estado, setEstado] = useState([['', '', ''], ['', '', "Stryker was here!"], ['', '', '']]);
     const [jogada, setJogada] = useState('X')
     const [ganhador, setGanhador] = useState('');
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ArrayDeclaration
src/App.js:5:42
 import './App.css';
 
 function App() {
-    const [estado, setEstado] = useState([['', '', ''], ['', '', ''], ['', '', '']]);
+    const [estado, setEstado] = useState([]);
     const [jogada, setJogada] = useState('X')
     const [ganhador, setGanhador] = useState('');
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/App.js:10:56
     const [ganhador, setGanhador] = useState('');
     const [jogadas, setJogadas] = useState(0);
 
-    const preencheCampo = (linhaIndex, colunaIndex) => {
-        setEstado((prev) => {
-            prev[linhaIndex][colunaIndex] = jogada;
-
-            return prev;
-        });
-
-        if (jogada === 'X') {
-            setJogada('O');
-        } else {
-            setJogada('X');
-        }
-
-        setJogadas(prev => prev + 1);
-    }
+    const preencheCampo = (linhaIndex, colunaIndex) => {}
 
     const verificaGanhou = useCallback(() => {
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] BlockStatement
src/App.js:11:29
     const [jogadas, setJogadas] = useState(0);
 
     const preencheCampo = (linhaIndex, colunaIndex) => {
-        setEstado((prev) => {
-            prev[linhaIndex][colunaIndex] = jogada;
-
-            return prev;
-        });
+        setEstado((prev) => {});
 
         if (jogada === 'X') {
killedBy: deveria falhar se o X não ganhar
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/App.js:17:29
             return prev;
         });
 
-        if (jogada === 'X') {
-            setJogada('O');
-        } else {
+        if (jogada === 'X') {} else {
             setJogada('X');
         }
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] ConditionalExpression
src/App.js:17:13
             return prev;
         });
 
-        if (jogada === 'X') {
+        if (true) {
             setJogada('O');
         } else {
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] StringLiteral
src/App.js:18:23
         });
 
         if (jogada === 'X') {
-            setJogada('O');
+            setJogada("");
         } else {
             setJogada('X');
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] BlockStatement
src/App.js:19:16
 
         if (jogada === 'X') {
             setJogada('O');
-        } else {
-            setJogada('X');
-        }
+        } else {}
 
         setJogadas(prev => prev + 1);
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ArrowFunction
src/App.js:23:20
             setJogada('X');
         }
 
-        setJogadas(prev => prev + 1);
+        setJogadas(() => undefined);
     }
 
killedBy: deveria falhar se o jogo não der velha
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ArithmeticOperator
src/App.js:23:28
             setJogada('X');
         }
 
-        setJogadas(prev => prev + 1);
+        setJogadas(prev => prev - 1);
     }
 
killedBy: deveria falhar se o jogo não der velha
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ArrayDeclaration
src/App.js:27:29
     }
 
     const verificaGanhou = useCallback(() => {
-        const estadoClone = [...estado];
+        const estadoClone = [];
         
         let x_ganhou_linha;
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/App.js:38:25
         let o_ganhou_diagonal_primaria;
         let o_ganhou_diagonal_secundaria;
         
-        for (let i = 0; i < 3; i++) {
+        for (let i = 0; i <= 3; i++) {
             x_ganhou_linha = 0;
             x_ganhou_coluna = 0;
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] UpdateOperator
src/App.js:48:36
             o_ganhou_diagonal_primaria = 0;
             o_ganhou_diagonal_secundaria = 0;
 
-            for (let j = 0; j < 3; j++) {
+            for (let j = 0; j < 3; j--) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/App.js:48:29
             o_ganhou_diagonal_primaria = 0;
             o_ganhou_diagonal_secundaria = 0;
 
-            for (let j = 0; j < 3; j++) {
+            for (let j = 0; j <= 3; j++) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] AssignmentOperator
src/App.js:49:48
             o_ganhou_diagonal_secundaria = 0;
 
             for (let j = 0; j < 3; j++) {
-                if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
+                if (estadoClone[i][j] === 'X') x_ganhou_linha -= 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ConditionalExpression
src/App.js:49:21
             o_ganhou_diagonal_secundaria = 0;
 
             for (let j = 0; j < 3; j++) {
-                if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
+                if (false) x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] EqualityOperator
src/App.js:50:21
 
             for (let j = 0; j < 3; j++) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
-                if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
+                if (estadoClone[j][i] !== 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] ConditionalExpression
src/App.js:50:21
 
             for (let j = 0; j < 3; j++) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
-                if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
+                if (true) x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] ConditionalExpression
src/App.js:51:21
             for (let j = 0; j < 3; j++) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
-                if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
+                if (true) x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] EqualityOperator
src/App.js:51:21
             for (let j = 0; j < 3; j++) {
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
-                if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
+                if (estadoClone[j][j] !== 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] ConditionalExpression
src/App.js:52:21
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
-                if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
+                if (true) x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] EqualityOperator
src/App.js:52:21
                 if (estadoClone[i][j] === 'X') x_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
-                if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
+                if (estadoClone[j][2 - j] !== 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] EqualityOperator
src/App.js:53:21
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
-                if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
+                if (estadoClone[i][j] !== 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] ConditionalExpression
src/App.js:53:21
                 if (estadoClone[j][i] === 'X') x_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
-                if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
+                if (true) o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] EqualityOperator
src/App.js:54:21
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
-                if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
+                if (estadoClone[j][i] !== 'O') o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] ConditionalExpression
src/App.js:54:21
                 if (estadoClone[j][j] === 'X') x_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
-                if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
+                if (true) o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] ConditionalExpression
src/App.js:55:21
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
-                if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
+                if (false) o_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
             }
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] EqualityOperator
src/App.js:55:21
                 if (estadoClone[j][2 - j] === 'X') x_ganhou_diagonal_secundaria += 1;
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
-                if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
+                if (estadoClone[j][j] !== 'O') o_ganhou_diagonal_primaria += 1;
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
             }
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] EqualityOperator
src/App.js:56:21
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
-                if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
+                if (estadoClone[j][2 - j] !== 'O') o_ganhou_diagonal_secundaria += 1;
             }
 
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] ConditionalExpression
src/App.js:56:21
                 if (estadoClone[i][j] === 'O') o_ganhou_linha += 1;
                 if (estadoClone[j][i] === 'O') o_ganhou_coluna += 1;
                 if (estadoClone[j][j] === 'O') o_ganhou_diagonal_primaria += 1;
-                if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
+                if (true) o_ganhou_diagonal_secundaria += 1;
             }
 
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  O GANHADOR FOI O: O

[Killed] EqualityOperator
src/App.js:59:41
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
             }
 
-            if (x_ganhou_linha === 3 || x_ganhou_coluna === 3 || x_ganhou_diagonal_primaria === 3 || x_ganhou_diagonal_secundaria === 3) {
+            if (x_ganhou_linha === 3 || x_ganhou_coluna !== 3 || x_ganhou_diagonal_primaria === 3 || x_ganhou_diagonal_secundaria === 3) {
                 setGanhador('X');
                 break;
killedBy: deveria falhar se o O não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: O
Received:
  O GANHADOR FOI O: X

[Killed] BlockStatement
src/App.js:59:138
                 if (estadoClone[j][2 - j] === 'O') o_ganhou_diagonal_secundaria += 1;
             }
 
-            if (x_ganhou_linha === 3 || x_ganhou_coluna === 3 || x_ganhou_diagonal_primaria === 3 || x_ganhou_diagonal_secundaria === 3) {
-                setGanhador('X');
-                break;
-            } 
+            if (x_ganhou_linha === 3 || x_ganhou_coluna === 3 || x_ganhou_diagonal_primaria === 3 || x_ganhou_diagonal_secundaria === 3) {} 
             if (o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3 || o_ganhou_diagonal_secundaria === 3) {
                 setGanhador('O');    
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] BlockStatement
src/App.js:63:138
                 setGanhador('X');
                 break;
             } 
-            if (o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3 || o_ganhou_diagonal_secundaria === 3) {
-                setGanhador('O');    
-                break;
-            }
+            if (o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3 || o_ganhou_diagonal_secundaria === 3) {}
             if (jogadas === 9){
                 setGanhador('-');
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] LogicalOperator
src/App.js:63:17
                 setGanhador('X');
                 break;
             } 
-            if (o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3 || o_ganhou_diagonal_secundaria === 3) {
+            if ((o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3) && o_ganhou_diagonal_secundaria === 3) {
                 setGanhador('O');    
                 break;
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] StringLiteral
src/App.js:64:29
                 break;
             } 
             if (o_ganhou_linha === 3 || o_ganhou_coluna === 3 || o_ganhou_diagonal_primaria === 3 || o_ganhou_diagonal_secundaria === 3) {
-                setGanhador('O');    
+                setGanhador("");    
                 break;
             }
killedBy: deveria falhar se o O não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] BlockStatement
src/App.js:67:31
                 setGanhador('O');    
                 break;
             }
-            if (jogadas === 9){
-                setGanhador('-');
-            }
+            if (jogadas === 9){}
         }
     }, [estado, jogadas]);
killedBy: deveria falhar se o jogo não der velha
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] EqualityOperator
src/App.js:67:17
                 setGanhador('O');    
                 break;
             }
-            if (jogadas === 9){
+            if (jogadas !== 9){
                 setGanhador('-');
             }
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  DEU VELHA: NÃO HOUVE GANHADOR!

[Killed] BlockStatement
src/App.js:73:21
         }
     }, [estado, jogadas]);
 
-    useEffect(() => {
-        verificaGanhou();
-    }, [jogada, verificaGanhou]);
+    useEffect(() => {}, [jogada, verificaGanhou]);
     
     return (
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ArrayDeclaration
src/App.js:75:8
 
     useEffect(() => {
         verificaGanhou();
-    }, [jogada, verificaGanhou]);
+    }, []);
     
     return (
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ConditionalExpression
src/App.js:79:25
     
     return (
         <div className="pagina">
-            {ganhador ? ganhador !== '-' ? (
+            {ganhador ? false ? (
                 <h1 data-testid="mensagem">O GANHADOR FOI O: {ganhador}</h1>
             ) : (
killedBy: deveria falhar se o X não ganhar
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  O GANHADOR FOI O: X
Received:
  DEU VELHA: NÃO HOUVE GANHADOR!

[Killed] ConditionalExpression
src/App.js:79:25
     
     return (
         <div className="pagina">
-            {ganhador ? ganhador !== '-' ? (
+            {ganhador ? true ? (
                 <h1 data-testid="mensagem">O GANHADOR FOI O: {ganhador}</h1>
             ) : (
killedBy: deveria falhar se o jogo não der velha
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  DEU VELHA: NÃO HOUVE GANHADOR!
Received:
  O GANHADOR FOI O: -

[Killed] ArrowFunction
src/App.js:86:29
             ) : null}
 
             <div className="conteudo-container"> 
-                {estado.map((linha, lIndex) => (
-                    linha.map((item, cIndex) => (
-                        <div 
-                            className="conteudo-borda"
-                            data-testid="conteudo"
-                            onClick={() => item === '' && ganhador === '' && preencheCampo(lIndex, cIndex)}
-                            key={cIndex}
-                        >
-                            {item}
-                        </div>
-                    ))
-                ))}
+                {estado.map(() => undefined)}
             </div>
 
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 9
Received length: 0
Received array:  []

[Killed] ArrowFunction
src/App.js:87:31
 
             <div className="conteudo-container"> 
                 {estado.map((linha, lIndex) => (
-                    linha.map((item, cIndex) => (
-                        <div 
-                            className="conteudo-borda"
-                            data-testid="conteudo"
-                            onClick={() => item === '' && ganhador === '' && preencheCampo(lIndex, cIndex)}
-                            key={cIndex}
-                        >
-                            {item}
-                        </div>
-                    ))
+                    linha.map(() => undefined)
                 ))}
             </div>
killedBy: deveria falhar se não encontrar os 9 quadradros clicaveis
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 9
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/App.js:91:44
                         <div 
                             className="conteudo-borda"
                             data-testid="conteudo"
-                            onClick={() => item === '' && ganhador === '' && preencheCampo(lIndex, cIndex)}
+                            onClick={() => false}
                             key={cIndex}
                         >
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Killed] ConditionalExpression
src/App.js:91:44
                         <div 
                             className="conteudo-borda"
                             data-testid="conteudo"
-                            onClick={() => item === '' && ganhador === '' && preencheCampo(lIndex, cIndex)}
+                            onClick={() => true}
                             key={cIndex}
                         >
killedBy: deveria falhar se o X não ganhar
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="mensagem"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pagina"
    >

[Survived] LogicalOperator
src/App.js:100:14
                 ))}
             </div>
 
-            {ganhador && (
-                <button onClick={() => {
-                    setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
-                    setGanhador('');
-                    setJogadas(0);
-                }}>
-                    Reiniciar jogo
-                </button>
-            )}
+            {ganhador || <button onClick={() => {
+  setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
+  setGanhador('');
+  setJogadas(0);
+}}>
+                    Reiniciar jogo
+                </button>}
         </div>
     );

[Survived] ConditionalExpression
src/App.js:100:14
                 ))}
             </div>
 
-            {ganhador && (
-                <button onClick={() => {
-                    setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
-                    setGanhador('');
-                    setJogadas(0);
-                }}>
-                    Reiniciar jogo
-                </button>
-            )}
+            {true}
         </div>
     );

[Survived] BlockStatement
src/App.js:101:40
             </div>
 
             {ganhador && (
-                <button onClick={() => {
-                    setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
-                    setGanhador('');
-                    setJogadas(0);
-                }}>
+                <button onClick={() => {}}>
                     Reiniciar jogo
                 </button>

[Survived] StringLiteral
src/App.js:102:69
 
             {ganhador && (
                 <button onClick={() => {
-                    setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
+                    setEstado([['', '', ''], ['', '', ''], ['', '', "Stryker was here!"]]);
                     setGanhador('');
                     setJogadas(0);

[Survived] ArrayDeclaration
src/App.js:102:32
 
             {ganhador && (
                 <button onClick={() => {
-                    setEstado([['', '', ''], ['', '', ''], ['', '', '']]);
+                    setEstado([[], ['', '', ''], ['', '', '']]);
                     setGanhador('');
                     setJogadas(0);
